tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/core'
tap 'homebrew/services'
tap 'thoughtbot/formulae'
# Cross-platform make
brew 'cmake'
# GNU File, Shell, and Text utilities
brew 'coreutils'
# Reimplementation of ctags(1)
brew 'ctags'
# Libraries to talk to Microsoft SQL Server and Sybase databases
brew 'freetds'
# Distributed revision control system
brew 'git'
# Library for command-line editing
brew 'readline'
# Command-line interface for SQLite
brew 'sqlite'
# Interpreted, interactive, object-oriented programming language
brew 'python'
# Core application library for C
brew 'glib'
# GNU Pretty Good Privacy (PGP) package
brew 'gnupg'
# Add GitHub support to git on the command-line
brew 'hub'
# Database of common MIME types
brew 'shared-mime-info'
# Tools and libraries to manipulate images in many formats
brew 'imagemagick'
# Open source relational database management system
brew 'mysql@5.7', restart_service: true, link: true
# Ambitious Vim-fork focused on extensibility and agility
brew 'neovim'
# Terminal multiplexer
brew 'tmux'
# Process manager for Procfile-based applications and tmux
brew 'overmind'
# 7-Zip (high compression file archiver) implementation
brew 'p7zip'
# Object-relational database system
brew 'postgresql'
# Reattach process (e.g., tmux) to background
brew 'reattach-to-user-namespace'
# Persistent key-value database, with built-in net interface
brew 'redis'
# Search tool like grep and The Silver Searcher
brew 'ripgrep'
# Powerful, clean, object-oriented scripting language
brew 'ruby'
# Count lines of code in many languages
brew 'sloccount'
# Tool to create intelligent and beautiful documentation
brew 'sphinx-doc'
# Vi 'workalike' with many additional features
brew 'vim'
# JavaScript package manager
brew 'yarn'
# management suite for dotfiles
brew 'thoughtbot/formulae/rcm'
