tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/core'
tap 'homebrew/services'
tap 'thoughtbot/formulae'
# Reimplementation of ctags(1)
brew 'ctags'
# Libraries to talk to Microsoft SQL Server and Sybase databases
brew 'freetds'
# Distributed revision control system
brew 'git'
# Add GitHub support to git on the command-line
brew 'hub'
# Tools and libraries to manipulate images in many formats
brew 'imagemagick'
# Open source relational database management system
brew 'mysql@5.7', restart_service: true
# Ambitious Vim-fork focused on extensibility and agility
brew 'neovim'
# Platform built on V8 to build network applications
brew 'node'
# Terminal multiplexer
brew 'tmux'
# Process manager for Procfile-based applications and tmux
brew 'overmind'
# 7-Zip (high compression file archiver) implementation
brew 'p7zip'
# Object-relational database system
brew 'postgresql'
# Command-line interface for SQLite
brew 'sqlite'
# Reattach process (e.g., tmux) to background
brew 'reattach-to-user-namespace'
# Persistent key-value database, with built-in net interface
brew 'redis'
# Library for command-line editing
brew 'readline'
# Search tool like grep and The Silver Searcher
brew 'ripgrep'
# Count lines of code in many languages
brew 'sloccount'
# Vi 'workalike' with many additional features
brew 'vim'
# JavaScript package manager
brew 'yarn'
# management suite for dotfiles
brew 'thoughtbot/formulae/rcm'
